[
    {
        "uutisId" : 1,
        "otsikko" : "Koronan outo oire: ohjelmistokehittäjät elävät tuottavuuden kulta-aikoja",
        "sisalto" : "<p>Muiden tapaan myös ohjelmistojen suunnittelijat ja kehittäjät joutuivat nopeasti turvautumaan kotikonttoreiden turvaan pandemian raivotessa ympäri maailmaa. Infoworldin mukaan nämä it-ammattilaiset ovat koronan yhtenä sivuvaikutuksena löytäneet duuneissaan aivan uuden tuottavuuden tason – jopa niin korkean, että suurin osa aikoo pysyäkin kodeissaan.</p>\r\n\r\n<p>Tämä ilmenee Accelerated Strategies Groupin tällä viikolla julkistamassa kyselyssä, jossa tutkimustalo oli haastatellut 23 maassa kaikkiaan 347 ohjelmistokehittäjää Pohjois-Amerikassa ja emea-alueella. Tutkimuksen toimeksiantaja on pilvipalveluja ja yrityssoftaa tarjoava CloudBees.</p>\r\n\r\n<p>Kyselyssä selvisi ainakin se, että noin 65 prosenttia etätöitä puskevista kehittäjistä aikoo pysytellä jatkossakin kotona ainakin kolmena päivänä viikossa. Lähes kaksi kolmasosaa arvioi heidän softatiimiensä tuottavuuden kohentuneen merkittävästi pandemian aikana. Vain joka kahdeksas arveli tuottavuuden heikentyneen etätöissä.</p>\r\n\r\n<p>Vaikka vain pieni osa vastaajista sanoi tehneensä menestyksellisesti töitä kotoa käsin jo kauan ennen pandemiaa, eivät etätyöt ole ohjelmistokehittäjille mitenkään tuntematon alue. Reilut 87 prosenttia on hoitanut töitään jossakin määrin kotona jo aiemmin.</p>\r\n\r\n<p>Tuottavuus on kohennut muun muassa sen takia, että kotona tehtävät on helpompi aikatauluttaa joustavasti. Samoin yhteistoiminta eri aikavyöhykkeillä toimivien tiimien kanssa on sujuvampaa, kun esimerkiksi työmatkoista ei ole tarvinnut huolehtia.</p>\r\n\r\n<p>Reilu puolet kehittäjistä arvioi koronapandemian nopeuttaneen heidän yritystensä pilvisiirtymää ja lisänneen panostuksia devopsiin.</p>\r\n"
    },
    {
        "uutisId" : 2,
        "otsikko" : "NASA’s James Webb Space Telescope Will Launch Into Orbit in December",
        "sisalto" : "<p>NASA has set a luanch date for their newest, most powerful telescope. The James Webb Space Telescope (JWST) will be launched into space on December 18 aboard a European Space Agency (ESA) Ariane 5 rocket, reports Abigail Beall for New Scientist. The orbiting infrared observatory will be the largest telescope ever launched into space. As the Hubble Space Telescope's successor, JWST is designed to complement and expand Hubble's discoveries with its extended wavelength coverage and improved light sensitivity, NPR's Nell Greenfieldboyce. Once launched into space, the observatory will travel to a location one million miles from Earth. From there, it will help astronomers understand how young galaxies form, peer through clouds to examine how stars take shape, study exoplanets, and observe nearby celestial objects, including planets within our own solar system, reports New Scientist. 'Webb will be able to see galaxies as they looked a couple hundred million years after the Big Bang,' NASA astrophysicist Jane Rigby tells NPR. First envisioned in 1996, construction of the enormous space observatory has cost a total of $10 billion. A team of 1,200 scientists, technicians, and engineers from 14 countries and more than 28 U.S. states have worked on the telescope in the past 25 years. To observe the far reaches of space, JWST will use four cameras and several sensor systems to collect data, writes Marcia Rieke, a JWST astronomer who worked on the Near Infrared Camera aboard the telescope, for The Conversation. The observatory will also use a colossal mirror consisting of 18 hexagonal mirrors assembled into a honeycomb shape that spans just over 21 feet across, New Scientist reports. Scientists decided the mirror needed to be this long because a telescope's sensitivity, or how much it can see, is related to the size of the mirror. The larger the mirror's area, the more light it can collect and the more it can see—sort of like increasing a camera's aperture. The mirrors are also lined with a microscopically thin layer of gold which helps reflect infrared light. In total, JWST's mirrors can collect more than six times more light than the Hubble telescope can, according to The Conversation. The telescope will work similarly to a satellite dish. Light from either a galaxy or a star will enter the telescope and bounce off its four cameras and sensors. The JWST will observe infrared light, whereas the Hubble telescope primarily observes ultraviolet light and visual elements of the electromagnetic spectrum. Creating a giant mirror that is not only large enough to peer deep into the mysteries of space but also light and cold enough to launch into orbit took a lot of planning and engineering. To achieve this, researchers built the hexagon-shaped mirrors out of beryllium, a light metal that will not warp at various temperatures. The segmented mirrors that weigh 46 pounds each also needed to fold origami-style so that they could fit inside the rocket and later bloom open once it reaches its destination, per NPR.</p>"
    }
]